index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-08-03 Sat 21:45 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>MoreLinear: some linear algebra in Clojure</title>
<meta name="generator" content="Org mode">
<meta name="author" content="George Kontsevich">
<meta name="description" content="Some linear algebra in Clojure"
>
<link rel="stylesheet" type="text/css" href="../web/worg.css" />
<link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=".."> UP </a>
 |
 <a accesskey="H" href=".."> HOME </a>
</div><div id="content">
<h1 class="title">MoreLinear: some linear algebra in Clojure</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga43a2fc">Preface</a></li>
<li><a href="#orgbd29bd7">Project managment</a></li>
<li><a href="#org0aba06c"><span class="todo TODO">TODO</span> s</a></li>
<li><a href="#orgc34154e">SRC<sub>Block</sub> template</a></li>
<li><a href="#org9c76cc9">End</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga43a2fc" class="outline-2">
<h2 id="orga43a2fc">Preface</h2>
<div class="outline-text-2" id="text-orga43a2fc">
<p>
This is a continuation (with some overlap) of what I have been developing in <a href="http://geokon-gh.github.io/elinear/index.html">elinear</a>. There I had developed a linear algebra system from scratch in ELisp and showed how to use it in several different fundamental applications. However as the algorithms become more complicated, the code started to get a little out of hand. A larger fraction of the time and code was spent on helper functions and extending the system to support different operations I needed and certain design simplifications and errors I had made at the beginning made the ultimate system inflexible and a bit unsatifying to work with.
</p>

<p>
To carry on working a bit less encumbered with my own mistakes, I've switched over to Clojure and the <code>core.matrix</code> library. (Note the <b>core</b> is meaningless and it's not part of the Clojure standard library) This already handles many little details I was lacking in my ELips implementation and as you'll see writing new algorithms will be much smoother. There will still need to be helper functions written, and there are probably places where I misuse the library due to ignorance. If you see any mistakes or room for improvement, please file an issue in the repo
</p>

<p>
Note that <code>core.matrix</code> is more of a "front end" API and it provides many different backends, some on the JVM others in JS. It's also not extremely performance focused and you can very easily end up doing operations that are very slow.
</p>

<p>
If you are concerned about getting as much as you can out of your system then I suggest looking at the <code>neanderthal</code> library which provides a thin wrapper around BLAS. It makes it very easy to work with BLAS and if you're on an x64 system this is the best CPU based performance you can hope for really. This project has a <code>neanderthal</code> branch where I starter implementing a few of the first functions. It should give you a good taste of what working in the more constrained BLAS environment looks like. It's an interesting work flow and really forces you to think a lot harder about your algorithms
</p>

<p>
However my goal here is mostly educational and I'm interested in running on as many platforms as possible. As before, this is an org document and can be tangled into the full Clojure project without the need for any external files. The tangled output is tracker in the repository so you can clone the project and launch a REPL without touching Emacs.
</p>

<p>
Explaining Clojure is outside the scope of this project!
</p>
</div>
</div>

<div id="outline-container-orgbd29bd7" class="outline-2">
<h2 id="orgbd29bd7">Project managment</h2>
<div class="outline-text-2" id="text-orgbd29bd7">
<p>
<b>TODO</b> Migrate to tools.deps
Project management in Clojure is done through a top level <code>project.clj</code> file which specified project details and the dependencies we will need. In our case it's just <code>core.matrix</code>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">defproject</span> <span style="color: #006699;">morelinear</span> <span style="color: #008000;">"0.1.0-SNAPSHOT"</span>
  <span style="color: #D0372D;">:description</span> <span style="color: #008000;">"linea-systems in Clojure"</span>
  <span style="color: #D0372D;">:url</span> <span style="color: #008000;">"http://geokon-gh.github.io/morelinear/index.html"</span>
  <span style="color: #D0372D;">:license</span> {<span style="color: #D0372D;">:name</span> <span style="color: #008000;">"Eclipse Public License"</span>
            <span style="color: #D0372D;">:url</span> <span style="color: #008000;">"http://www.eclipse.org/legal/epl-v10.html"</span><span style="color: #999999;">}</span>
  <span style="color: #D0372D;">:dependencies</span> [
                 [<span style="color: #6434A3;">org.clojure</span>/clojure <span style="color: #008000;">"1.10.0"</span><span style="color: #999999;">]</span>
                 [<span style="color: #6434A3;">net.mikera</span>/core.matrix <span style="color: #008000;">"0.62.0"</span><span style="color: #999999;">]]</span>
  <span style="color: #D0372D;">:main</span> ^<span style="color: #D0372D;">:skip-aot</span> morelinear.core
  <span style="color: #D0372D;">:target-path</span> <span style="color: #008000;">"target/%s"</span>
  <span style="color: #D0372D;">:profiles</span> {<span style="color: #D0372D;">:uberjar</span> {<span style="color: #D0372D;">:aot</span> <span style="color: #D0372D;">:all</span><span style="color: #999999;">}})</span>

</pre>
</div>
<p>
The rest of the code will live in <code>src/core.clj</code> as is the convention (maybe if there is a lot of code or parts to break off, these will be in separate namespaces/files..)
We start by declaring the project namespace and including all of <code>core.matrix</code>. Since we will be using it extensively and I don't want to overload any of its names, I'm not even bothering to alias it.
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">ns</span> <span style="color: #6434A3;">morelinear.core</span>
  (<span style="color: #D0372D;">:require</span> [clojure.core.matrix <span style="color: #D0372D;">:refer</span> <span style="color: #D0372D;">:all</span><span style="color: #999999;">])</span>
  (<span style="color: #D0372D;">:gen-class</span><span style="color: #999999;">))</span>

(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">-main</span>
  <span style="color: #036A07;">"I don't do a whole lot ... yet."</span>
  [&amp; args<span style="color: #999999;">]</span>
  (println <span style="color: #008000;">"Hello, World!"</span><span style="color: #999999;">))</span>

</pre>
</div>
<p>
The <code>-main</code> is just a placeholder for the moment
</p>
</div>
</div>


<div id="outline-container-org0aba06c" class="outline-2">
<h2 id="org0aba06c"><span class="todo TODO">TODO</span> s</h2>
<div class="outline-text-2" id="text-org0aba06c">
<ul class="org-ul">
<li>add some TODOs</li>
</ul>
</div>
</div>
<div id="outline-container-orgc34154e" class="outline-2">
<h2 id="orgc34154e">SRC<sub>Block</sub> template</h2>
<div class="outline-text-2" id="text-orgc34154e">
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">defn-</span> <span style="color: #006699;">matrix-template</span>
  <span style="color: #036A07;">"template"</span>
  [matrix<span style="color: #999999;">]</span>
  <span style="color: #999999;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c76cc9" class="outline-2">
<h2 id="org9c76cc9">End</h2>
<div class="outline-text-2" id="text-org9c76cc9">
<blockquote>
<p>
This webpage is generated from an org-document (at <code>./index.org</code>) that also generates all the files described. 
</p>

<p>
Once opened in Emacs:<br>
</p>
<ul class="org-ul">
<li><code>C-c C-e h h</code> generates the webpage  <br></li>
<li><code>C-c C-v C-t</code> exports the code blocks into the appropriate files<br></li>
<li><code>C-c C-c</code>     org-babel-execute-src-block</li>
<li><code>C-c C-v C-b</code> org-babel-execute-buffer</li>
</ul>
</blockquote>
</div>
</div>
</div>
</body>
</html>
